Repository: AsmaAbdullah/CAPSTONE-HOPE
Catalog: HOPE/HOPE/View/*.lproj/Localizable.strings
Languages: ar_sa

source: Many people benefit from counseling, either on their own or in a group setting. - Things you can accomplish with a mental health professional include: - Finding out what triggers your anger. - Avoiding destructive responses. - Finding healthy ways to express your feelings. - Learning valuable coping skills. - Addressing related issues, such as addiction or relationship problems. - A counselor can also evaluate whether chronic anger is contributing to clinical depression.
ar_sa: يستفيد الكثير من الأشخاص من الاستشارة ، سواء بمفردهم أو في إطار جماعي. - تشمل الأشياء التي يمكنك إنجازها مع أخصائي الصحة العقلية ما يلي: - اكتشاف ما يثير غضبك. - تجنب الاستجابات المدمرة. - إيجاد طرق صحية للتعبير عن مشاعرك . - تعلم مهارات التأقلم القيمة. - معالجة القضايا ذات الصلة ، مثل الإدمان أو مشاكل العلاقات. - يمكن للمستشار أيضًا تقييم ما إذا كان الغضب المزمن يساهم في الاكتئاب السريري.

source: Anxiety may be described as feeling nervous, on edge, or worried. It is a normal emotion that alerts your body to respond to a threat. But intense and long-term anxiety is a disorder. It may interfere with your daily life and relationships.
ar_sa: يمكن وصف القلق بأنه الشعور بالتوتر أو القلق أو القلق. إنه شعور طبيعي ينبه جسمك للاستجابة للتهديد. لكن القلق الشديد وطويل الأمد هو اضطراب. وقد يتعارض مع حياتك اليومية وعلاقاتك .

source: Anxiety and cancer
ar_sa: القلق والسرطان

source: Many people with cancer have symptoms of anxiety. A cancer diagnosis may trigger these feelings: - Fear of treatment or treatment-related side effects. - Fear of cancer returning or spreading after treatment. - Uncertainty. - Worry over losing independence. - Concern about having relationships change. - Fear of death. Anxiety may make it harder to cope with cancer treatment. It may also reduce your ability to make choices about your care. As a result, identifying and managing anxiety are important parts of cancer treatment. * Acute anxiety symptoms. You may often experience short periods of the symptoms listed below. A panic attack is when a person has all of these symptoms at once: - Feeling intense fear or dread. - Feeling detached from yourself or your surroundings. - Heart palpitations or rapid heartbeat. - High blood pressure. - Chest pain.
ar_sa: يعاني الكثير من المصابين بالسرطان من أعراض القلق. قد يؤدي تشخيص السرطان إلى إثارة هذه المشاعر: - الخوف من العلاج أو الآثار الجانبية المرتبطة بالعلاج. - الخوف من عودة السرطان أو انتشاره بعد العلاج. - عدم اليقين. - القلق بشأن فقدان الاستقلالية. - القلق حول تغيير العلاقات. - الخوف من الموت. قد يجعل القلق من الصعب التعامل مع علاج السرطان. وقد يقلل أيضًا من قدرتك على اتخاذ خيارات بشأن رعايتك. ونتيجة لذلك ، يعد تحديد القلق وإدارته جزءًا مهمًا من علاج السرطان. * أعراض القلق الحاد: قد تواجهك غالبًا فترات قصيرة من الأعراض المذكورة أدناه. نوبة الهلع هي عندما يظهر على الشخص كل هذه الأعراض في وقت واحد: - الشعور بالخوف الشديد أو الرهبة. - الشعور بالانفصال عن نفسك أو محيطك. - خفقان القلب أو تسارع في ضربات القلب - ارتفاع ضغط الدم - ألم في الصدر.

source: Chronic anxiety symptoms
ar_sa: أعراض القلق المزمن

source: Chronic anxiety typically last for a longer time. They may include acute anxiety episodes along with 1 or more of the symptoms below: - Excessive worrying. - Restlessness. - Muscle tension. - Insomnia, which is not being able to fall or stay asleep. - Irritability. - Fatigue. - Difficulty concentrating. - Indecision, which is having trouble making decisions. * Risk factors for anxiety. People with cancer are more likely to feel anxiety if they have these risk factors: - Previous diagnosis of anxiety or depression. - Family history of anxiety or depression. - Lack of support of friends or family. - Financial burdens
ar_sa: عادة ما يستمر القلق المزمن لفترة أطول. وقد تشمل نوبات القلق الحاد إلى جانب واحد أو أكثر من الأعراض التالية: - القلق المفرط. - الأرق. - توتر العضلات. - الأرق ، وهو عدم القدرة على النوم أو الاستمرار في النوم . - التهيج. - التعب. - صعوبة التركيز. - التردد ، مما يؤدي إلى صعوبة اتخاذ القرارات. * عوامل الخطر للقلق. - الأشخاص المصابون بالسرطان هم أكثر عرضة للشعور بالقلق إذا كانت لديهم عوامل الخطر هذه: - التشخيص السابق للقلق أو الاكتئاب . - تاريخ عائلي من القلق أو الاكتئاب. - عدم وجود دعم من الأصدقاء أو الأسرة. - أعباء مالية

source: Treatment types
ar_sa: أنواع العلاج

source: There are a variety of ways to cope with anxiety. Many are used together. - Relaxation techniques. Relaxation techniques may be used alone or along with other types of treatment. - Psychological Treatment. Mental health professionals include licensed counselors, psychologists, and psychiatrists. They provide tools to improve coping skills, develop a support system, and reshape negative thoughts. Options include individual therapy, couples or family therapy, and group therapy. - Medication. If your anxiety symptoms are moderate to severe, you may benefit from medication. Different types of medications are available.
ar_sa: هناك مجموعة متنوعة من الطرق للتعامل مع القلق. يتم استخدام العديد منها معًا. - تقنيات الاسترخاء. يمكن استخدام تقنيات الاسترخاء وحدها أو جنبًا إلى جنب مع أنواع العلاج الأخرى. - العلاج النفسي. يشمل أخصائيو الصحة العقلية المستشارين المرخصين وعلماء النفس والأطباء النفسيين . إنها توفر أدوات لتحسين مهارات التأقلم ، وتطوير نظام دعم ، وإعادة تشكيل الأفكار السلبية. وتشمل الخيارات العلاج الفردي ، والعلاج بالأزواج أو الأسرة ، والعلاج الجماعي. - الأدوية. إذا كانت أعراض القلق لديك معتدلة إلى شديدة ، فقد تستفيد من الأدوية . أنواع مختلفة من الأدوية متوفرة.

source: Some people with cancer may experience depression before, during, or after cancer treatment. Depression is a type of mood disorder. It may make it harder to cope with cancer treatment.
ar_sa: قد يعاني بعض الأشخاص المصابين بالسرطان من الاكتئاب قبل أو أثناء أو بعد علاج السرطان. الاكتئاب هو نوع من اضطرابات المزاج. وقد يجعل من الصعب التعامل مع علاج السرطان.

source: Mood-related symptoms
ar_sa: الأعراض المرتبطة بالمزاج

source: - Feeling down. - Feeling sad. - Feeling hopeless. - Feeling irritable. - Feeling numb. - Feeling worthless. * Behavioral symptoms: - Loss of interest in activities that you used to enjoy. - Frequent crying. - Withdrawal from friends or family. - Loss of motivation to do daily activities. * Cognitive symptoms: - Trouble focusing. - Difficulty making decisions. - Memory problems. - Negative thoughts. In extreme situations, these may include thoughts that life is not worth living or thoughts of hurting yourself.
ar_sa: - الشعور بالإحباط. - الشعور بالحزن. - الشعور باليأس. - الشعور بالضيق. - الشعور بالخدر. - الشعور بعدم القيمة. * الأعراض السلوكية: - فقدان الاهتمام بالأنشطة التي كنت تستمتع بها. - البكاء المتكرر. - الانسحاب من الأصدقاء أو الأسرة. - فقدان الدافع للقيام بالأنشطة اليومية. * الأعراض المعرفية: - صعوبة في التركيز. - صعوبة اتخاذ القرارات. - مشاكل الذاكرة. - الأفكار السلبية. في المواقف المتطرفة ، قد تشمل هذه الأفكار أن الحياة لا تستحق العيش أو أفكار الأذى نفسك.

source: Physical symptoms
ar_sa: الأعراض الجسدية

source: - Fatigue. - Appetite loss. - Insomnia, which is not being able to fall asleep and stay asleep. - Hypersomnia, which is feeling very sleepy most of the time. - Sexual problems, such as lower sexual desire. The cognitive and physical symptoms listed above may be side effects of the cancer or cancer treatment. As a result, doctors place more emphasis on mood-related and behavior symptoms when diagnosing depression in a person with cancer. * Risk factors for depression. People with cancer are more likely to have depression if they have these risk factors: - Previous diagnosis of depression or anxiety. - Family history of depression or anxiety. - Lack of support from friends or family. - Financial burdens
ar_sa: - التعب. - فقدان الشهية. - الأرق ، وهو عدم القدرة على النوم والاستمرار في النوم. - فرط النوم ، وهو الشعور بالنعاس الشديد في معظم الأوقات. - مشاكل جنسية ، مثل انخفاض الرغبة الجنسية. - المعرفية والجسدية قد تكون الأعراض المذكورة أعلاه آثارًا جانبية للسرطان أو علاج السرطان. ونتيجة لذلك ، يركز الأطباء بشكل أكبر على الأعراض المرتبطة بالمزاج والسلوك عند تشخيص الاكتئاب لدى شخص مصاب بالسرطان. * عوامل خطر الإصابة بالاكتئاب. الأشخاص المصابون بالسرطان هم أكثر عرضة الإصابة بالاكتئاب إذا كانت لديهم عوامل الخطر التالية: - التشخيص السابق للاكتئاب أو القلق. - التاريخ العائلي للاكتئاب أو القلق. - الافتقار إلى الدعم من الأصدقاء أو العائلة. - الأعباء المالية

source: Treatment of depression
ar_sa: علاج الاكتئاب

source: People with depression usually benefit from specialized treatment. For people with moderate or severe depression, a mix of psychological treatment and medication is often the most effective approach. For some people with mild depression, talking with a mental health professional may be enough to relieve depressive symptoms. - Psychological treatment. Mental health professionals include licensed counselors, psychologists, and psychiatrists. - Options include individual therapy, couples or family therapy, and group therapy. - Medications. Different types of antidepressant medications are available. Your doctor will select the most appropriate antidepressant based on these factors: - Your needs, Potential side effects, Other medications you take, and Your medical history.
ar_sa: يستفيد الأشخاص المصابون بالاكتئاب عادةً من العلاج المتخصص. بالنسبة للأشخاص الذين يعانون من اكتئاب متوسط أو شديد ، غالبًا ما يكون مزيج من العلاج النفسي والأدوية هو النهج الأكثر فعالية. بالنسبة لبعض الأشخاص المصابين بالاكتئاب الخفيف ، قد يكون التحدث مع أخصائي الصحة العقلية كافياً للتخفيف أعراض الاكتئاب. - العلاج النفسي. يشمل أخصائيو الصحة العقلية المستشارين والأطباء النفسيين والأطباء النفسيين المرخص لهم. - تشمل الخيارات العلاج الفردي ، والأزواج أو العلاج الأسري ، والعلاج الجماعي. - الأدوية. تتوفر أنواع مختلفة من الأدوية المضادة للاكتئاب. سيحدد طبيبك ما يلي أنسب مضاد للاكتئاب بناءً على هذه العوامل: - احتياجاتك ، والآثار الجانبية المحتملة ، والأدوية الأخرى التي تتناولها ، وتاريخك الطبي.

source: It is normal to be afraid of side effects when you start cancer treatment. You may have heard stories from family and friends who have had cancer about their experiences.
ar_sa: من الطبيعي أن تخاف من الآثار الجانبية عند بدء علاج السرطان. ربما سمعت قصصًا من العائلة والأصدقاء الذين أصيبوا بالسرطان حول تجاربهم.

source: How can I cope with my fears of side effects?
ar_sa: كيف يمكنني التعامل مع مخاوفي من الآثار الجانبية؟

source: Remember that the long-term goal of treatment is to help you, not hurt you. Many cancer treatments used today are less intense and take less time than in the past. And many side effects last only a short time in general. Here are some tips for coping with the fear of side effects. - Take an active role in your treatment planning, also called shared decision making. These conversations with your doctor should include possible side effects of different treatment approaches. - Ask when to expect which side effects during and after your treatment period so you know what to watch for and won't be surprised if they occur. - Ask a member of your cancer care team for a list of possible symptoms that may require immediate medical care. - Write down all of your questions and concerns, no matter how big or small, including ones that you may have heard from a friend or family member. - Communicate often. Let your doctor, nurse, and other providers know what you're thinking and experiencing so they can help.
ar_sa: تذكر أن الهدف طويل المدى من العلاج هو مساعدتك ، وليس إيذائك. العديد من علاجات السرطان المستخدمة اليوم أقل حدة وتستغرق وقتًا أقل مما كانت عليه في الماضي. والعديد من الآثار الجانبية تستمر لفترة قصيرة فقط بشكل عام. فيما يلي بعض النصائح للتعامل مع الخوف من الآثار الجانبية. - قم بدور نشط في تخطيط العلاج الخاص بك ، والذي يسمى أيضًا اتخاذ القرار المشترك. يجب أن تتضمن هذه المحادثات مع طبيبك الآثار الجانبية المحتملة لأساليب العلاج المختلفة. - اسأل متى تتوقع الآثار الجانبية أثناء فترة العلاج وبعدها حتى تعرف ما يجب مراقبته ولن تتفاجأ في حالة حدوثه. - اسأل أحد أعضاء فريق رعاية مرضى السرطان للحصول على قائمة بالأعراض المحتملة التي قد تتطلب رعاية طبية فورية. - دوِّن كل ما يلي أسئلتك ومخاوفك ، مهما كانت كبيرة أو صغيرة ، بما في ذلك تلك التي ربما تكون قد سمعتها من صديق أو أحد أفراد الأسرة. - تواصل كثيرًا. دع طبيبك وممرضتك ومقدمي الخدمات الآخرين يعرفون ما تفكر فيه وتختبره يمكن أن تساعدنا

source: Talking about your fear of cancer side effects
ar_sa: التحدث عن خوفك من الآثار الجانبية للسرطان

source: In addition to talking with your cancer care team, it can be helpful to communicate with others too. Talk with your family and loved ones about your fear of side effects and other worries. Their support can make you feel less anxious and your loved ones can better understand your feelings. Be sure to share information provided by your health care team about what to expect. Together, you can think through possible caregiving needs and solutions or other plans. You might want to talk with your supervisor or human resources person at your workplace about your treatment and possible side effects. This conversation may cover how you can adjust your schedule during treatment if you need to. Ask your cancer care team about meeting with a social worker who can help you navigate these types of conversations. It can also help to talk to someone who has been through the same type of treatment you will go through.
ar_sa: بالإضافة إلى التحدث مع فريق رعاية مرضى السرطان ، قد يكون من المفيد التواصل مع الآخرين أيضًا. تحدث مع عائلتك وأحبائك عن خوفك من الآثار الجانبية ومخاوف أخرى. قد يجعلك دعمهم تشعر بقلق أقل وأحبائك يمكن أن تفهم مشاعرك بشكل أفضل. تأكد من مشاركة المعلومات التي قدمها فريق الرعاية الصحية الخاص بك حول ما يمكن توقعه. معًا ، يمكنك التفكير في احتياجات وحلول تقديم الرعاية المحتملة أو الخطط الأخرى. قد ترغب في التحدث مع مشرفك أو مسؤول الموارد البشرية على مكان عملك حول علاجك والآثار الجانبية المحتملة. قد تغطي هذه المحادثة كيف يمكنك تعديل جدولك أثناء العلاج إذا احتجت إلى ذلك. اسأل فريق رعاية مرضى السرطان حول مقابلة أخصائي اجتماعي يمكنه مساعدتك في التنقل في هذه الأنواع من المحادثات. يمكن أن تساعد أيضًا في التحدث إلى شخص خضع لنفس النوع من العلاج الذي ستخضع له

source: Questions to ask the health care team
ar_sa: أسئلة لطرحها على فريق الرعاية الصحية

source: - What symptoms can I expect from this specific type and stage of cancer? - What side effects are common from each treatment in my cancer treatment plan? - When is it likely that side effects will occur? How long will they last? - Is there anything I can do to prepare for these side effects? - What can the health care team do to prevent or relieve side effects? - Who should I tell if I begin experiencing side effects from treatment? How soon? - What side effects or symptoms are considered emergencies? - Who do I contact if I have questions about a side effect? Who can I contact after hours when the clinic is closed?
ar_sa: - ما الأعراض التي يمكن أن أتوقعها من هذا النوع المحدد ومرحلة السرطان؟ - ما الآثار الجانبية الشائعة من كل علاج في خطة علاج السرطان الخاصة بي؟ - متى يحتمل حدوث هذه الآثار الجانبية؟ ما هي المدة التي ستستمر فيها؟ - هل هل هناك أي شيء يمكنني القيام به للاستعداد لهذه الآثار الجانبية؟ - ما الذي يمكن لفريق الرعاية الصحية فعله للوقاية من الآثار الجانبية أو تخفيفها؟ - من الذي يجب أن أخبره إذا بدأت أعاني من الآثار الجانبية من العلاج؟ ما هو أقرب وقت؟ - ما الآثار الجانبية أو الأعراض تعتبر حالات طوارئ؟ - بمن أتصل إذا كانت لدي أسئلة حول أحد الآثار الجانبية؟ بمن يمكنني الاتصال بعد ساعات من إغلاق العيادة؟

source: Many people living with cancer experience guilt. Guilt is a feeling of blame and regret that is usually hard to accept and express.
ar_sa: يشعر الكثير من المصابين بالسرطان بالذنب. الشعور بالذنب هو شعور باللوم والندم يصعب عادةً قبوله والتعبير عنه

source: Many people living with cancer experience guilt. Guilt is a feeling of blame and regret that is usually hard to accept and express. Guilt often leads people to replay 'what if' and 'if only' scenarios in their minds to figure out what they could have done differently. People with cancer may feel guilt at various times for different reasons. For example, you may feel guilty because: - You could have noticed symptoms earlier or gone to the doctor sooner. - You worry that you are a burden to your family or caregivers. - The treatment you received did not work the way you had hoped. - The cancer comes with financial costs or causes you to spend time away from work for treatment. - You survived cancer while others did not. This is also called “survivor’s guilt.” - You blame yourself or feel embarrassed or ashamed of lifestyle choices and habits that may have increased your risk of developing cancer.
ar_sa: يشعر الكثير من الأشخاص المصابين بالسرطان بالذنب. الشعور بالذنب هو شعور باللوم والندم يصعب عادةً قبوله والتعبير عنه. غالبًا ما يؤدي الشعور بالذنب الناس إلى تكرار سيناريوهات “ ماذا لو “ و“إذا كان فقط “ في أذهانهم لمعرفة ما هم يمكن أن يفعلوا بشكل مختلف. قد يشعر الأشخاص المصابون بالسرطان بالذنب في أوقات مختلفة لأسباب مختلفة. على سبيل المثال ، قد تشعر بالذنب لأن: - ربما لاحظت الأعراض في وقت سابق أو ذهبت إلى الطبيب في وقت قريب. - تشعر بالقلق من أنك تتحمل عبئًا على عائلتك أو مقدمي الرعاية. - العلاج الذي تلقيته لم يعمل بالطريقة التي كنت تأملها. - يأتي السرطان مع تكاليف مالية أو يتسبب في قضاء بعض الوقت بعيدًا عن العمل لتلقي العلاج. - لقد نجت من السرطان بينما لم يفعل الآخرون. هذا أيضًا يسمى “ذنب الناجي“. - تلوم نفسك أو تشعر بالحرج أو الخجل من اختيارات نمط الحياة والعادات التي قد تزيد من خطر الإصابة بالسرطان

source: Coping with guilt
ar_sa: التعامل مع الذنب

source: Feelings of guilt are common, but it is not healthy to keep thinking about them. Feeling very guilty about events outside of your control and not being able to let go of guilt can lead to depression. Although depression is more common among people with cancer, it should not be considered a normal part of living with cancer.
ar_sa: الشعور بالذنب أمر شائع ، ولكن من غير الصحي الاستمرار في التفكير فيها. قد يؤدي الشعور بالذنب الشديد حيال أحداث خارجة عن إرادتك وعدم القدرة على التخلي عن الشعور بالذنب إلى الإصابة بالاكتئاب. على الرغم من أن الاكتئاب أكثر شيوعًا بين الأشخاص المصابين بالسرطان ، لا ينبغي اعتباره جزءًا طبيعيًا من التعايش مع السرطان

source: Letting go of guilt
ar_sa: التخلي عن الذنب

source: Letting go of guilt can help improve your well-being and your ability to cope with cancer. Consider the following tips to reduce guilty feelings: - Remember that cancer is not your fault—or anyone else’s. Experts do not fully understand why most types of cancer develop. Sometimes people with cancer feel guilty about specific lifestyle choices they made, such as cigarette smoking. - Know that your feelings of guilt will come and go. Just like all difficult emotions triggered by a diagnosis of cancer, your feelings of guilt will change over time. - Share your feelings. Talk about the guilt you are feeling with someone you trust or with a counselor or social worker.
ar_sa: إن التخلي عن الشعور بالذنب يمكن أن يساعد في تحسين صحتك وقدرتك على التعامل مع السرطان. ضع في اعتبارك النصائح التالية لتقليل الشعور بالذنب: - تذكر أن السرطان ليس خطأك - أو خطأ أي شخص آخر. لا يفهم الخبراء تمامًا سبب وجود معظم الأنواع الإصابة بالسرطان. يشعر المصابون بالسرطان أحيانًا بالذنب بشأن خيارات نمط الحياة المحددة التي اتخذوها ، مثل تدخين السجائر. - اعلم أن شعورك بالذنب سيأتي ويذهب. تمامًا مثل كل المشاعر الصعبة التي يثيرها تشخيص السرطان ، فإن شعورك بالذنب سوف يتغير بمرور الوقت. - شارك مشاعرك. تحدث عن الذنب الذي تشعر به مع شخص تثق به أو مع مستشار أو أخصائي اجتماعي.

source: Metastasis occurs when cancer spreads to a different part of the body from where it started. Metastasis should not be confused with “locally advanced cancer.” That is cancer that has spread to nearby tissues or lymph nodes.
ar_sa: يحدث الانبثاث عندما ينتشر السرطان إلى جزء مختلف من الجسم من حيث بدأ. لا ينبغي الخلط بين ورم خبيث “سرطان متقدم موضعيًا“. هذا هو السرطان الذي انتشر إلى الأنسجة المجاورة أو العقد الليمفاوية.

source: Naming metastatic cancer
ar_sa: تسمية السرطان النقيلي

source: You may find the naming of metastatic cancer confusing. Doctors name a metastasis for the original cancer. For example, breast cancer that spreads to the bone is not bone cancer. It is called metastatic breast cancer. * What does it mean to have metastatic cancer? In the past, many people did not live long with metastatic cancer. Even with today’s better treatments, recovery is not always possible. But doctors can often treat cancer even if they cannot cure it. A good quality of life is possible for months or even years. * How is metastatic cancer treated? Treatment depends on the type of cancer, the available treatment options, and your wishes. It also depends on your age, general health, treatment you had before, and other factors. Treatments for metastatic cancer include surgery, chemotherapy, hormone therapy, immunotherapy, and radiation therapy.
ar_sa: قد تجد أن تسمية السرطان النقيلي محيرة. يسمي الأطباء ورم خبيث للسرطان الأصلي. على سبيل المثال ، سرطان الثدي الذي ينتشر إلى العظام ليس سرطان العظام. يطلق عليه سرطان الثدي النقيلي. * ماذا يعني أن يكون لديك نقائل السرطان؟ في الماضي ، لم يكن الكثير من الناس يعيشون طويلاً وهم مصابون بالسرطان النقيلي. وحتى مع العلاجات الأفضل اليوم ، فإن التعافي ليس ممكنًا دائمًا. ولكن يمكن للأطباء في كثير من الأحيان علاج السرطان حتى لو لم يتمكنوا من علاجه. ويمكن الحصول على نوعية حياة جيدة لأشهر أو حتى سنوات. * كيف يتم علاج السرطان النقيلي؟ يعتمد العلاج على نوع السرطان وخيارات العلاج المتاحة ورغباتك. كما يعتمد أيضًا على عمرك وصحتك العامة والعلاج الذي تلقيته من قبل وعوامل أخرى. يشمل السرطان الجراحة والعلاج الكيميائي والعلاج الهرموني والعلاج المناعي والعلاج الإشعاعي

source: Goals of treatment
ar_sa: أهداف العلاج

source: For many people with cancer, the goal of treatment is to try to cure the cancer. This means getting rid of the cancer and never having it come back. With metastatic cancer, curing the cancer may not be a realistic goal. However, it might still be a hope or dream. It is reasonable to ask your doctor if curing the cancer is the goal. If curing the cancer is not the goal of treatment, the goal is to help a person live as well as possible for as long as possible. Getting more specific, this goal can be broken into 4 parts: - To have the fewest possible side effects from the cancer. - To have the fewest possible side effects from the cancer treatment. - For the person with cancer to have the best quality of life. - For the person with cancer to live as long as possible with the cancer. Each person values these items differently. It is important to tell your health care team what is important to you. Getting treatment for metastatic cancer can help you live longer and feel better. But getting treatment is always your decision.
ar_sa: بالنسبة للعديد من المصابين بالسرطان ، فإن الهدف من العلاج هو محاولة علاج السرطان. وهذا يعني التخلص من السرطان وعدم عودته أبدًا. مع السرطان النقيلي ، قد لا يكون علاج السرطان هدفًا واقعيًا. ومع ذلك ، فإنه قد يظل أملًا أو حلمًا. فمن المعقول أن تسأل طبيبك عما إذا كان علاج السرطان هو الهدف. إذا لم يكن علاج السرطان هو الهدف من العلاج ، فالهدف هو مساعدة الشخص على العيش بشكل أفضل قدر الإمكان. ممكن. للحصول على مزيد من التحديد ، يمكن تقسيم هذا الهدف إلى 4 أجزاء: - للحصول على أقل عدد ممكن من الآثار الجانبية من السرطان. - للحصول على أقل عدد ممكن من الآثار الجانبية من علاج السرطان. - لكي يحصل الشخص المصاب بالسرطان على أفضل النتائج نوعية الحياة. - لكي يعيش الشخص المصاب بالسرطان أطول فترة ممكنة مع السرطان. كل شخص يقدر هذه العناصر بشكل مختلف. من المهم أن تخبر فريق الرعاية الصحية الخاص بك بما هو مهم بالنسبة لك. الحصول على علاج من السرطان النقيلي يمكن أن يساعدك عش أطول وأشعر بتحسن ، لكن جيتي إن العلاج هو قرارك دائمًا

source: The challenges of living with cancer
ar_sa: تحديات التعايش مع السرطان
