Repository: AsmaAbdullah/CAPSTONE-HOPE
Catalog: HOPE/HOPE/View/*.lproj/Localizable.strings
Languages: ar_sa

source: Living with metastatic cancer is challenging. The challenges are different for everyone, but they can include: - Feeling upset that the cancer came back. You might feel hopeless, angry, sad, or like no one understands what you are going through, even family. - Worrying that treatment will not help and the cancer will get worse. - Dealing with tests, doctor’s appointments, and decisions. - Talking with family and friends about the cancer. - Needing help with daily activities if you feel exhausted or have side effects from treatment. - Finding emotional and spiritual support. - Coping with the cost of more treatment. Even if you have insurance, it might not cover everything.
ar_sa: العيش مع السرطان النقيلي يمثل تحديًا. تختلف التحديات بالنسبة للجميع ، ولكنها يمكن أن تشمل: - الشعور بالضيق من عودة السرطان. قد تشعر باليأس أو الغضب أو الحزن أو أنه لا أحد يفهم ما تمر به ، حتى الأسرة. - القلق من أن العلاج لن يساعد وأن السرطان سيزداد سوءًا. - التعامل مع الاختبارات ومواعيد الطبيب والقرارات. - التحدث مع العائلة والأصدقاء حول السرطان. - الحاجة إلى المساعدة في الأنشطة اليومية إذا شعرت بالإرهاق أو كان لديك جانب الآثار المترتبة على العلاج. - العثور على الدعم العاطفي والروحي. - التعامل مع تكلفة المزيد من العلاج. حتى لو كان لديك تأمين ، فقد لا يغطي كل شيء.

source: Logout
ar_sa: تسجيل الخروج

source: Are you sure to log out?
ar_sa: هل أنت متأكد من تسجيل الخروج؟

source: OK
ar_sa: موافق

source: Cancel
ar_sa: إلغاء

source: (937) Service
ar_sa: خدمة (937)

source: National Center (NCMH)
ar_sa: المركز الوطني (NCMH)

source: King Faisal Specialist Hospital
ar_sa: مستشفى الملك فيصل التخصصي

source: Saudi Cancer Society
ar_sa: الجمعية السعودية لمكافحة السرطان

source: Zahra Association
ar_sa: جمعية زهرة

source: Sanad Association
ar_sa: جمعية سند

source: Basma Association
ar_sa: جمعية بسمة

source: Atfalona Association
ar_sa: جمعية أطفالنا

source: Amass Association
ar_sa: جمعية أمسّ

source: Al-Hayat Association
ar_sa: جمعية الحياة

source: Tfaul Association
ar_sa: جمعية تفاؤل

source: Tahoor Association
ar_sa: جمعية طهور

source: Al-Iman Association
ar_sa: جمعية الايمان

source: Tafaul Association
ar_sa: جمعية تفاؤل

source: National Center for Mental Health Promotion
ar_sa: المركز الوطني لتعزيز الصحة النفسية

source: Amass Association Friends of Cancer Patients
ar_sa: أمسّ جمعية أصدقاء مرضى السرطان

source: Sanad Children's Cancer Support Association
ar_sa: جمعية سند لدعم سرطان الأطفال

source: Balsam Association
ar_sa: جمعية بلسم

source: The Number Has Been Copied
ar_sa: تم نسخ الرقم
