Repository: AsmaAbdullah/CAPSTONE-HOPE
Catalog: HOPE/HOPE/View/*.lproj/Localizable.strings
Languages: ar_sa

source: Invalid Login
ar_sa: خطأ في تسجيل الدخول

source: Please fill Email and Password
ar_sa: الرجاء إدخال البريد الإلكتروني وكلمة المرور

source: Ok
ar_sa: موافق

source: Oh!
ar_sa: أوه!

source: This email is not already Signup
ar_sa: هذا البريد الإلكتروني لم يتم تسجيله بالفعل

source: Invalid Signup
ar_sa: خطأ في التسجيل

source: Please fill Name, Email and Password
ar_sa: الرجاء إدخال الاسم والبريد الإلكتروني وكلمة المرور

source: The email address is already in use by another account.
ar_sa: عنوان البريد الإلكتروني قيد الاستخدام بالفعل من قبل حساب آخر.

source: Self-Image and Cancer
ar_sa: الصورة الذاتية والسرطان

source: - Physical changes. - Emotional changes. - Coping with self-image changes.
ar_sa: - التغيرات الجسدية. - التغيرات العاطفية - التعامل مع تغيرات الصورة الذاتية.

source: Coping With Uncertainty
ar_sa: التعامل مع عدم اليقين

source: - Causes of uncertainty. - Dealing with the “what ifs” of cancer.
ar_sa: - أسباب عدم اليقين. - التعامل مع”ماذا لو” السرطان.

source: Managing Stress
ar_sa: إدارة الإجهاد

source: - Tips for reducing stress. - Stress management strategies. - Relaxation techniques.
ar_sa: - نصائح لتقليل التوتر. - استراتيجيات إدارة الإجهاد. - تقنيات الاسترخاء.

source: Coping with Anger
ar_sa: التعامل مع الغضب

source: - Coping with anger. - Considering counseling
ar_sa: - التعامل مع الغضب. - الإرشاد النفسي

source: Anxiety
ar_sa: القلق

source: - Anxiety and cancer. - Acute anxiety symptoms. - Chronic anxiety symptoms. - Treatment types.
ar_sa: - القلق والسرطان. - أعراض القلق الحاد. - أعراض القلق المزمن. - أنواع العلاج.

source: Depression
ar_sa: الإكتئاب

source: - Mood-related symptoms. - Behavioral symptoms. - Physical symptoms. - Treatment of depression.
ar_sa: - الأعراض المرتبطة بالمزاج. - الأعراض السلوكية. - الأعراض الجسدية. - علاج الاكتئاب.

source: Managing the Fear
ar_sa: إدارة الخوف

source: - How can I cope with my fears of side effects? - Talking about your fear of cancer side effects. - Questions to ask the health care team.
ar_sa: - كيف يمكنني التعامل مع مخاوفي من الآثار الجانبية؟ - التحدث عن خوفك من الآثار الجانبية للسرطان. - أسئلة لطرحها على فريق الرعاية الصحية.

source: Coping with Guilt
ar_sa: التعامل مع الشعور بالذنب

source: - Coping with guilt. - Letting go of guilt.
ar_sa: - التعامل مع الذنب. - التخلي عن الشعور بالذنب.

source: Coping with Cancer
ar_sa: التعامل مع السرطان

source: - Naming metastatic cancer. - Goals of treatment - The challenges of living with cancer
ar_sa: - تسمية السرطان المنتشر. - أهداف العلاج. - تحديات التعايش مع السرطان

source: You Already have added this session
ar_sa: لقد أضفت هذه الجلسة بالفعل

source: Has been successfully added
ar_sa: تمت الإضافة بنجاح

source: Self-image is how a person views himself or herself. Because of the many physical and emotional changes after a cancer diagnosis, people may experience positive and negative changes to their self-image.
ar_sa: الصورة الذاتية هي الطريقة التي ينظر بها الشخص إلى نفسه. وبسبب التغييرات الجسدية والعاطفية العديدة بعد تشخيص الإصابة بالسرطان ، قد يعاني الأشخاص من تغيرات إيجابية وسلبية في صورتهم الذاتية.

source: Physical changes
ar_sa: تغيرات فيزيائية

source: Both cancer and its treatment may change how you look. How you feel about your appearance is called body image. Many people with cancer feel self-conscious about changes to their bodies. Some of the more common physical changes of cancer include: - Hair loss - Weight gain or weight loss - Surgery scars - Rash, typically from drug therapies - Loss of an organ, limb, or breast - The need for an ostomy, which is a surgical opening that allows bodily waste to exit the body into a bag - Fatigue or loss of energy, which can cause you to give up activities you once enjoyed. Many of these changes will resolve or get better as time passes after treatment. But make sure to share any concerns you have with your health care team. Ask them for more information about ways to relieve these symptoms or the emotional discomfort you may feel because of them.
ar_sa: قد يغير كل من السرطان وعلاجه من مظهرك. يطلق على شعورك حيال مظهرك صورة الجسد. يشعر الكثير من المصابين بالسرطان بالوعي الذاتي بشأن التغييرات التي تطرأ على أجسامهم. وتشمل بعض التغيرات الجسدية الأكثر شيوعًا للسرطان ما يلي: - الشعر فقدان الوزن - زيادة الوزن أو إنقاص الوزن - ندوب الجراحة - الطفح الجلدي عادةً من العلاجات الدوائية - فقدان عضو أو طرف أو صدر - الحاجة إلى فغر ، وهي فتحة جراحية تسمح بخروج الفضلات الجسدية وضع الجسم في كيس. - التعب أو فقدان الطاقة ، والذي يمكن أن يتسبب في التخلي عن الأنشطة التي كنت تتمتع بها من قبل. العديد من هذه التغييرات ستحل أو تتحسن مع مرور الوقت بعد العلاج. ولكن تأكد من مشاركة أي مخاوف لديك مع فريق الرعاية الصحية الخاص بك. اطلب منهم المزيد من المعلومات حول طرق تخفيف هذه الأعراض أو الانزعاج العاطفي الذي قد تشعر به بسببها

source: Emotional changes
ar_sa: التغييرات العاطفية

source: Cancer disrupts so many parts of a person’s life, from relationships to work and hobbies. Depending on the seriousness of the illness and the chance of recovery, it may also force you to make changes to your future and deal with the chance of dying. During this time, you may feel many different emotions: - Sadness, Anxiety - Loneliness or a sense of being different from others - Fear, Anger, Frustration, Guilt - Feeling out of control - A change in the way you think about yourself and the future. But many people with cancer have also reported positive changes. These positive changes can be emotional, spiritual, or intellectual. For example, you may feel: - An appreciation for the strength of your body. - Peace, Gratitude - Awareness and appreciation that life is short and special. - Grateful for new important relationships with caregivers and other patients. - A shift in priorities. - Clarity about meaning in life and personal goals
ar_sa: السرطان يعطل أجزاء كثيرة جدًا من حياة الشخص ، من العلاقات إلى العمل والهوايات. اعتمادًا على خطورة المرض وفرصة الشفاء ، قد يجبرك أيضًا على إجراء تغييرات في مستقبلك والتعامل مع فرصة الموت. خلال هذا الوقت ، قد تشعر بالعديد من المشاعر المختلفة: - الحزن والقلق. - الوحدة أو الشعور بالاختلاف عن الآخرين. - الخوف ، والغضب ، والإحباط ، والشعور بالذنب. - الشعور بالخروج عن السيطرة. - تغيير في طريقة تفكيرك. عن نفسك والمستقبل. لكن العديد من المصابين بالسرطان أبلغوا أيضًا عن تغييرات إيجابية. يمكن أن تكون هذه التغييرات الإيجابية عاطفية أو روحية أو فكرية. على سبيل المثال ، قد تشعر بما يلي: - تقدير لقوة جسمك. - سلام ، امتنان . - الوعي والتقدير بأن الحياة قصيرة ومميزة. - ممتن لعلاقات مهمة جديدة مع مقدمي الرعاية والمرضى الآخرين. - تحول في الأولويات. - وضوح المعنى في الحياة والأهداف الشخصية

source: Coping with self-image changes
ar_sa: التعامل مع تغييرات الصورة الذاتية

source: You may view yourself and your body differently after cancer. These tips may help you cope: - Allow time to adjust. Accepting a cancer diagnosis and undergoing treatment may change your life. It takes time to adapt. - Talk with others who have been in similar situations. - Build a network of friends and family who can support you and help you feel positive. - Ask for and accept help. Pass off tasks that take up your energy and are not pleasing to you. - Stay calm and, if you are able, embrace humor. - Ask your health care team about possible reconstructive surgery, prosthetic devices, and/or cosmetic solutions. - As much as possible, remain active. - Seek counseling.
ar_sa: قد تنظر إلى نفسك وجسمك بشكل مختلف بعد السرطان. قد تساعدك هذه النصائح في التأقلم: - إتاحة الوقت للتكيف. قد يؤدي قبول تشخيص السرطان والخضوع للعلاج إلى تغيير حياتك. يستغرق الأمر وقتًا للتكيف. - تحدث مع الآخرين الذين سبق لهم العلاج. في مواقف مماثلة. - بناء شبكة من الأصدقاء والعائلة الذين يمكنهم دعمك ومساعدتك على الشعور بالإيجابية. - اطلب المساعدة وتقبلها. تخلص من المهام التي تستهلك طاقتك ولا ترضيك. - ابق هادئًا وإذا أنت قادر ، احتضن الدعابة. - اسأل فريق الرعاية الصحية الخاص بك عن الجراحة الترميمية الممكنة ، والأجهزة التعويضية ، و / أو الحلول التجميلية. - قدر الإمكان ، حافظ على نشاطك. - اطلب المشورة.

source: Many people with cancer may feel a lack of certainty about what the future holds. After a cancer diagnosis, you may feel that your life is less secure than it once was. It is important to ask for support when you are feeling this way.
ar_sa: قد يشعر الكثير من المصابين بالسرطان بعدم اليقين بشأن ما يخبئه المستقبل. بعد تشخيص السرطان ، قد تشعر أن حياتك أصبحت أقل أمانًا مما كانت عليه في السابق. من المهم أن تطلب الدعم عندما تشعر بهذه الطريقة.

source: Causes of uncertainty
ar_sa: أسباب عدم اليقين

source: Both newly diagnosed patients and long-term survivors have common worries. These may include: - Having to put plans on hold. You may feel like you are unable to look to the future. Making plans is difficult for many practical reasons. For instance, it can be hard to plan a family vacation when you may not know exactly when you will have treatment. You may not be able to commit to a lunch date because you cannot predict how you will be feeling. Some people feel unable to make any plans. One approach that works well for many people with cancer is to remain flexible and accept that plans may change. - Fear about cancer treatment and side effects. You may be worried or scared of the possible side effects of treatment, such as pain, nausea, or fatigue. Or you may fear becoming dependent on others during cancer treatment or missing activities that you enjoy. Learn more about coping with the fear of treatment side effects. Long-term cancer survivors may worry about having late effects. These are side effects of cancer treatment that happen months or years after treatment ends. Talk with your health care team about possible late effects and how they can be managed. There are resources available if you need help. - The treatment will not work. No treatment works the same for every person, even those with the same type of cancer. Some treatments are more effective for some people. Other treatments may work but cause side effects.
ar_sa: كل من المرضى الذين تم تشخيصهم حديثًا والناجين على المدى الطويل لديهم مخاوف مشتركة. قد تشمل هذه: - الاضطرار إلى تعليق الخطط. قد تشعر أنك غير قادر على التطلع إلى المستقبل. وضع الخطط صعب لأسباب عملية كثيرة. على سبيل المثال ، قد يكون من الصعب التخطيط لقضاء إجازة عائلية عندما لا تعرف بالضبط متى ستتلقى العلاج. قد لا تتمكن من الالتزام بموعد غداء لأنك لا تستطيع التنبؤ بما ستشعر به. يشعر بعض الأشخاص بعدم القدرة على القيام بأي الخطط. أحد الأساليب التي تعمل بشكل جيد للعديد من الأشخاص المصابين بالسرطان هي أن تظل مرنًا وتقبل أن الخطط قد تتغير. - الخوف من علاج السرطان والآثار الجانبية. قد تكون قلقًا أو خائفًا من الآثار الجانبية المحتملة للعلاج ، مثل الألم ، الغثيان أو الإرهاق. أو قد تخشى الاعتماد على الآخرين أثناء علاج السرطان أو تفويت الأنشطة التي تستمتع بها. تعرف على المزيد حول التعامل مع الخوف من الآثار الجانبية للعلاج. قد يشعر الناجون من السرطان على المدى الطويل بالقلق بشأن الآثار المتأخرة. هذه هي الآثار الجانبية لعلاج السرطان التي تحدث بعد أشهر أو سنوات من انتهاء العلاج. تحدث مع فريق الرعاية الصحية الخاص بك عن الآثار المتأخرة المحتملة وكيف يمكن إدارتها. هناك موارد متاحة إذا كنت بحاجة إلى مساعدة. - العلاج لن يجدي. لا يوجد علاج يعمل بالطريقة نفسها لكل شخص ، حتى أولئك الذين يعانون من نفس النوع من السرطان. تكون بعض العلاجات أكثر فاعلية بالنسبة لبعض الأشخاص. قد تنجح العلاجات الأخرى ولكنها تسبب آثارًا جانبية

source: - The treatment will stop working. Many times, people continue to receive a treatment until it stops working. This is especially true for those with cancer that has spread or those with cancer that is controlled with drugs for a long time. It is scary to think that the drug could stop working, even if you know that there are other treatment options. - The cancer will come back. A cancer recurrence is when the cancer returns after treatment. It is a top fear of many cancer survivors. If you worry about this, you may find yourself paying attention to every potential symptom you have. In turn, this can increase your general level of anxiety. Learn more about coping with the fear of recurrence. - Fear of dying or losing someone you love. Facing the idea of dying can be difficult. Feeling fear is natural when you think about dying or losing someone you love. It’s normal to struggle with a fear of death. Yet, if these feelings become stronger, talk with your health care team about resources to help you cope.
ar_sa: - سيتوقف العلاج عن العمل. في كثير من الأحيان ، يستمر الأشخاص في تلقي العلاج حتى يتوقف عن العمل. وهذا ينطبق بشكل خاص على المصابين بالسرطان الذي انتشر أو المصابين بالسرطان الذي يتم التحكم فيه بالعقاقير لفترة طويلة. إنه أمر مخيف الاعتقاد بأن الدواء يمكن أن يتوقف عن العمل ، حتى لو كنت تعلم أن هناك خيارات علاج أخرى. - السرطان سوف يعود. تكرار السرطان هو عندما يعود السرطان بعد العلاج. إنه خوف كبير لكثير من الناجين من السرطان. إذا كنت تقلق بشأن هذا ، قد تجد نفسك منتبهًا لكل عرض محتمل لديك. وهذا بدوره يمكن أن يزيد من مستوى القلق العام لديك. تعرف على المزيد حول التعامل مع الخوف من التكرار. - الخوف من الموت أو فقدان شخص تحبه. مواجهة يمكن أن تكون فكرة الموت صعبة. الشعور بالخوف طبيعي عندما تفكر في الموت أو فقدان شخص تحبه. من الطبيعي أن تكافح مع الخوف من الموت. ومع ذلك ، إذا أصبحت هذه المشاعر أقوى ، تحدث مع فريق الرعاية الصحية الخاص بك عن الموارد لمساعدتك على التأقلم

source: Dealing with the “what ifs” of cancer
ar_sa: التعامل مع ”ماذا لو“ للسرطان

source: Acknowledging the unknowns of cancer may make you feel anxious, angry, sad, or afraid. You may even have physical symptoms from these feelings. For instance, it may cause sleeping problems or make it harder to focus at work. Learning to manage the uncertainty is an important part of staying healthy. These tips may help you cope: - Recognize that there are situations you can control and those you cannot. As hard as it sounds, many people find it helpful to let go of those things that they cannot change and focus on their reaction to events. - Talk with your health care team if your feelings of uncertainty are affecting your daily life. They can help you find the resources you need to feel better.
ar_sa: إن التعرف على المجهول المتعلق بالسرطان قد يجعلك تشعر بالقلق أو الغضب أو الحزن أو الخوف. وقد تظهر عليك أعراض جسدية من هذه المشاعر. على سبيل المثال ، قد يتسبب ذلك في مشاكل في النوم أو يجعل التركيز في العمل أكثر صعوبة. تعلم كيفية إدارة عدم اليقين هو جزء مهم من البقاء بصحة جيدة. قد تساعدك هذه النصائح في التأقلم: - أدرك أن هناك مواقف يمكنك التحكم فيها وتلك التي لا يمكنك التحكم فيها. وبقدر ما يبدو الأمر صعبًا ، يجد العديد من الأشخاص أنه من المفيد التخلي عن تلك الأشياء التي لا يستطيعون السيطرة عليها التغيير والتركيز على رد فعلهم تجاه الأحداث. - تحدث مع فريق الرعاية الصحية الخاص بك إذا كانت مشاعر عدم اليقين لديك تؤثر على حياتك اليومية. يمكنهم مساعدتك في العثور على الموارد التي تحتاجها لتشعر بتحسن.

source: A disease such as cancer is often one of the most stressful experiences of a person's life. Coping with cancer can be more challenging with added stress from work, family, or financial concerns.
ar_sa: مرض مثل السرطان غالبًا ما يكون أحد أكثر التجارب إرهاقًا في حياة الشخص. يمكن أن يكون التعامل مع السرطان أكثر صعوبة مع ضغوط إضافية من العمل أو الأسرة أو المخاوف المالية.

source: Tips for reducing stress
ar_sa: نصائح لتقليل التوتر

source: Stressors are sources of stress. Some stressors are predictable and, therefore, sometimes avoidable. Consider the following tips for reducing stress: - Avoid scheduling conflicts. Use a day planner, your phone, or an online calendar to keep track of appointments and activities. - Be aware of your limits. If you do not have the time, energy, or interest, it is okay to politely decline when people ask you to take on tasks. - Ask for help. It is also good sense to ask family, friends, and coworkers for help. - Prioritize your tasks. Make a list of the things you routinely do, such as work and household chores. - Break down tasks into smaller steps. Sometimes large tasks can be done in smaller steps. - Concentrate your efforts on things you can control. A stressor may be something you cannot change or control, even with the best planning. - Get help with financial problems. Talk with an oncology social worker or a financial advisor who knows about cancer-related insurance and financial matters.
ar_sa: الضغوطات هي مصادر التوتر. بعض عوامل الضغط يمكن التنبؤ بها ، وبالتالي يمكن تجنبها في بعض الأحيان. ضع في اعتبارك النصائح التالية لتقليل التوتر: - تجنب تعارض المواعيد. استخدم مخططًا لليوم ، أو هاتفك ، أو تقويمًا عبر الإنترنت لتتبع المواعيد والأنشطة - كن على دراية بحدودك. إذا لم يكن لديك الوقت أو الطاقة أو الاهتمام ، فلا بأس أن ترفض بأدب عندما يطلب منك الناس القيام بمهام. - اطلب المساعدة. ومن المنطقي أيضًا أن تطلب من العائلة ، الأصدقاء وزملاء العمل للمساعدة. - حدد أولويات المهام الخاصة بك. قم بعمل قائمة بالأشياء التي تقوم بها بشكل روتيني ، مثل العمل والأعمال المنزلية. - قسّم المهام إلى خطوات أصغر. في بعض الأحيان يمكن إنجاز المهام الكبيرة بخطوات أصغر. - ركز الجهود المبذولة في الأشياء التي يمكنك التحكم فيها. قد يكون عامل الضغط شيئًا لا يمكنك تغييره أو التحكم فيه ، حتى مع التخطيط الأفضل. - احصل على مساعدة في المشكلات المالية. تحدث إلى أخصائي اجتماعي في علم الأورام أو مستشار مالي يعرف عن التأمين المتعلق بالسرطان والشؤون المالية أماه المضايقين

source: Stress management strategies
ar_sa: استراتيجيات إدارة الإجهاد

source: Although you can try to reduce the number of stressors in your life, you cannot completely avoid stress. The following are tips to help reduce stress: - Exercise regularly. Moderate exercise such as a 30-minute walk several times a week can help lower stress. - Spend time outside. If possible, take a walk outside in a park or other natural setting. - Schedule social activities. Make time to socialize with family or friends. - Eat well. Maintaining a healthy diet and getting enough rest will give you more energy to deal with daily stressors. - Get plenty of sleep. Life is busy and some people may think that sleep is indulgent. - Join a support group. Support groups offer you the chance to talk about your feelings and fears with others who share and understand your experiences. - Schedule daily relaxing time. Spend time doing an activity you find relaxing. - Do things you enjoy. Eat at your favorite restaurant or watch your favorite television show.
ar_sa: على الرغم من أنه يمكنك محاولة تقليل عدد الضغوطات في حياتك ، إلا أنه لا يمكنك تجنب التوتر تمامًا. فيما يلي بعض النصائح للمساعدة في تقليل التوتر: - ممارسة الرياضة بانتظام. يمكن أن تساعد التمارين المعتدلة مثل المشي لمدة 30 دقيقة عدة مرات في الأسبوع في تقليل الإجهاد. - قضاء الوقت في الخارج. إذا كان ذلك ممكنًا ، يمكنك المشي بالخارج في حديقة أو في مكان طبيعي آخر. - جدولة الأنشطة الاجتماعية. خصص وقتًا للاختلاط مع العائلة أو الأصدقاء. - تناول طعامًا جيدًا. الحفاظ على نظام غذائي صحي والحصول على قسط كاف من الراحة سيعطي لديك المزيد من الطاقة للتعامل مع الضغوطات اليومية. - احصل على قسط كافٍ من النوم. الحياة مزدحمة وقد يعتقد بعض الناس أن النوم متسامح. - انضم إلى مجموعة دعم. تقدم لك مجموعات الدعم فرصة للتحدث عن مشاعرك ومخاوفك مع الآخرين الذين شارك تجاربك وافهمها. - حدد وقتًا للاسترخاء يوميًا. اقض وقتًا في القيام بنشاط تجده مريحًا. - افعل أشياء تستمتع بها. تناول الطعام في مطعمك المفضل أو شاهد برنامجك التلفزيوني المفضل.

source: Relaxation techniques
ar_sa: تقنيات الاسترخاء

source: Many people learn and practice relaxation techniques to lower stress. You can learn most of them in a few sessions with a counselor. such as during a medical procedure: - Relaxed or deep breathing. - Mental imagery or visualization. - Progressive muscle relaxation. - Meditation. - Biofeedback. - Yoga.
ar_sa: كثير من الناس يتعلمون ويمارسون تقنيات الاسترخاء لتقليل التوتر. يمكنك تعلم معظمها في بضع جلسات مع مستشار. مثل أثناء إجراء طبي: - التنفس العميق أو الاسترخاء. - التخيل العقلي أو التخيل. - الاسترخاء التدريجي للعضلات. - التأمل. - الارتجاع البيولوجي. - اليوجا.

source: Many people living with cancer experience anger. Often, the feeling arises when receiving a cancer diagnosis. But it can develop any time throughout treatment and survivorship.
ar_sa: يعاني الكثير من المصابين بالسرطان من الغضب. وغالبًا ما ينشأ الشعور عند تلقي تشخيص السرطان. ولكن يمكن أن يتطور في أي وقت خلال فترة العلاج والبقاء على قيد الحياة.

source: Coping with anger
ar_sa: التعامل مع الغضب

source: Anger is a natural emotional response. You do not need to feel guilt if you experience it. Anger is not bad. But some people deal with it and express it in unhealthy ways. Unhealthy expressions of anger * Unhealthy responses to anger include: - Avoiding expressing the difficult emotions. - Behaving in ways that hurt others or yourself. - Abusing alcohol or drugs. Unhealthy responses to anger can lead to depression. Learn more about the signs and symptoms of depression and how to find help.
ar_sa: الغضب هو رد فعل عاطفي طبيعي. لا داعي للشعور بالذنب إذا مررت به. الغضب ليس سيئًا. لكن بعض الناس يتعاملون معه ويعبرون عنه بطرق غير صحية. تعبيرات الغضب غير الصحية. * الاستجابات غير الصحية للغضب تشمل: - تجنب التعبير عن المشاعر الصعبة. - التصرف بطرق تؤذي الآخرين أو تؤذي نفسك. - تعاطي الكحول أو المخدرات. يمكن أن تؤدي الاستجابات غير الصحية للغضب إلى الاكتئاب. تعرف على المزيد حول علامات وأعراض الاكتئاب وكيفية الحصول على المساعدة.

source: * Healthy expressions of anger
ar_sa: * تعبيرات صحية عن الغضب

source: Healthy anger management involves identifying the emotion and expressing it productively. Consider the following tips when you feel angry: - Recognize your anger. Sometimes people act out of anger without acknowledging the emotion's presence. - Consider which other feelings lie underneath the anger. Sometimes, people hide other painful feelings under their anger. And they might not even realize they are doing this. Some people feel more comfortable with anger than other feelings, like fear or sadness. - Avoid taking out your anger on others. Direct your anger at the cause of the feelings, not at other people. - Do not wait for anger to build up. Express your feelings as soon as you recognize them. If you hold them in, you are more likely to express anger in an unhealthy way. Find safe ways to express your anger. You can express and release your anger in a number of healthy ways: - Discuss the reasons for your anger with a trusted family member or friend. - Do a physical activity while feeling your anger at its full intensity. - Beat on a pillow with your fists, or find a punching bag. - Yell out loud in a car or private room. - Explore complementary therapies, such as massage, relaxation techniques, music, or art
ar_sa: تتضمن إدارة الغضب الصحية تحديد المشاعر والتعبير عنها بطريقة مثمرة. ضع في اعتبارك النصائح التالية عندما تشعر بالغضب: - التعرف على غضبك. أحيانًا يتصرف الناس بدافع الغضب دون الاعتراف بوجود المشاعر. - فكر في المشاعر الأخرى الكامنة تحت الغضب. أحيانًا ، يخفي الناس مشاعر مؤلمة أخرى تحت غضبهم. وقد لا يدركون حتى أنهم يفعلون ذلك. يشعر بعض الناس براحة أكبر مع الغضب مقارنة بالمشاعر الأخرى ، مثل الخوف أو الحزن. - تجنب إثارة غضبك على الآخرين. وجّه غضبك إلى سبب المشاعر ، ليس لدى الآخرين. - لا تنتظر حتى يتراكم الغضب. عبر عن مشاعرك بمجرد أن تتعرف عليها. إذا كنت تمسك بها ، فمن المرجح أن تعبر عن الغضب بطريقة غير صحية. ابحث طرق آمنة للتعبير عن غضبك. يمكنك التعبير عن غضبك والتخلص منه بعدة طرق صحية: - ناقش أسباب غضبك مع أحد أفراد الأسرة أو الأصدقاء الموثوق بهم. - قم بنشاط بدني أثناء ه الشعور بغضبك بكامل حدته. - اضرب على وسادة بقبضتيك ، أو ابحث عن كيس ملاكمة. - صرخ بصوت عالٍ في السيارة أو الغرفة الخاصة. - اكتشف العلاجات التكميلية ، مثل التدليك أو تقنيات الاسترخاء أو الموسيقى أو الفن

source: Considering counseling.
ar_sa: النظر في المشورة
